turbq/atprog/packs/atmel/SAM4L_DFP/1.1.61/sam4l4/atdf/ATSAM4LS4C.atdf
        <register name="ODCR1C" offset="0x118" rw="RW" size="4" access-size="4" atomic-op="clear:ODCR1" caption="Output Driving Capability Register 1 - Clear">
          <bitfield name="P0" caption="Output Driving Capability Register Bit 1" mask="0x1"/>
          <bitfield name="P1" caption="Output Driving Capability Register Bit 1" mask="0x2"/>
          <bitfield name="P2" caption="Output Driving Capability Register Bit 1" mask="0x4"/>
          <bitfield name="P3" caption="Output Driving Capability Register Bit 1" mask="0x8"/>
          <bitfield name="P4" caption="Output Driving Capability Register Bit 1" mask="0x10"/>
          <bitfield name="P5" caption="Output Driving Capability Register Bit 1" mask="0x20"/>
          <bitfield name="P6" caption="Output Driving Capability Register Bit 1" mask="0x40"/>
          <bitfield name="P7" caption="Output Driving Capability Register Bit 1" mask="0x80"/>
          <bitfield name="P8" caption="Output Driving Capability Register Bit 1" mask="0x100"/>
          <bitfield name="P9" caption="Output Driving Capability Register Bit 1" mask="0x200"/>
          <bitfield name="P10" caption="Output Driving Capability Register Bit 1" mask="0x400"/>
          <bitfield name="P11" caption="Output Driving Capability Register Bit 1" mask="0x800"/>
          <bitfield name="P12" caption="Output Driving Capability Register Bit 1" mask="0x1000"/>
          <bitfield name="P13" caption="Output Driving Capability Register Bit 1" mask="0x2000"/>
          <bitfield name="P14" caption="Output Driving Capability Register Bit 1" mask="0x4000"/>
          <bitfield name="P15" caption="Output Driving Capability Register Bit 1" mask="0x8000"/>
          <bitfield name="P16" caption="Output Driving Capability Register Bit 1" mask="0x10000"/>
          <bitfield name="P17" caption="Output Driving Capability Register Bit 1" mask="0x20000"/>
          <bitfield name="P18" caption="Output Driving Capability Register Bit 1" mask="0x40000"/>
          <bitfield name="P19" caption="Output Driving Capability Register Bit 1" mask="0x80000"/>
          <bitfield name="P20" caption="Output Driving Capability Register Bit 1" mask="0x100000"/>
          <bitfield name="P21" caption="Output Driving Capability Register Bit 1" mask="0x200000"/>
          <bitfield name="P22" caption="Output Driving Capability Register Bit 1" mask="0x400000"/>
          <bitfield name="P23" caption="Output Driving Capability Register Bit 1" mask="0x800000"/>
          <bitfield name="P24" caption="Output Driving Capability Register Bit 1" mask="0x1000000"/>
          <bitfield name="P25" caption="Output Driving Capability Register Bit 1" mask="0x2000000"/>
          <bitfield name="P26" caption="Output Driving Capability Register Bit 1" mask="0x4000000"/>
          <bitfield name="P27" caption="Output Driving Capability Register Bit 1" mask="0x8000000"/>
          <bitfield name="P28" caption="Output Driving Capability Register Bit 1" mask="0x10000000"/>
          <bitfield name="P29" caption="Output Driving Capability Register Bit 1" mask="0x20000000"/>
          <bitfield name="P30" caption="Output Driving Capability Register Bit 1" mask="0x40000000"/>
          <bitfield name="P31" caption="Output Driving Capability Register Bit 1" mask="0x80000000"/>
        </register>
        <register name="ODCR1T" offset="0x11C" rw="RW" size="4" access-size="4" atomic-op="toggle:ODCR1" caption="Output Driving Capability Register 1 - Toggle">
          <bitfield name="P0" caption="Output Driving Capability Register Bit 1" mask="0x1"/>
          <bitfield name="P1" caption="Output Driving Capability Register Bit 1" mask="0x2"/>
          <bitfield name="P2" caption="Output Driving Capability Register Bit 1" mask="0x4"/>
          <bitfield name="P3" caption="Output Driving Capability Register Bit 1" mask="0x8"/>
          <bitfield name="P4" caption="Output Driving Capability Register Bit 1" mask="0x10"/>
          <bitfield name="P5" caption="Output Driving Capability Register Bit 1" mask="0x20"/>
          <bitfield name="P6" caption="Output Driving Capability Register Bit 1" mask="0x40"/>
          <bitfield name="P7" caption="Output Driving Capability Register Bit 1" mask="0x80"/>
          <bitfield name="P8" caption="Output Driving Capability Register Bit 1" mask="0x100"/>
          <bitfield name="P9" caption="Output Driving Capability Register Bit 1" mask="0x200"/>
          <bitfield name="P10" caption="Output Driving Capability Register Bit 1" mask="0x400"/>
          <bitfield name="P11" caption="Output Driving Capability Register Bit 1" mask="0x800"/>
          <bitfield name="P12" caption="Output Driving Capability Register Bit 1" mask="0x1000"/>
          <bitfield name="P13" caption="Output Driving Capability Register Bit 1" mask="0x2000"/>
          <bitfield name="P14" caption="Output Driving Capability Register Bit 1" mask="0x4000"/>
          <bitfield name="P15" caption="Output Driving Capability Register Bit 1" mask="0x8000"/>
          <bitfield name="P16" caption="Output Driving Capability Register Bit 1" mask="0x10000"/>
          <bitfield name="P17" caption="Output Driving Capability Register Bit 1" mask="0x20000"/>
          <bitfield name="P18" caption="Output Driving Capability Register Bit 1" mask="0x40000"/>
          <bitfield name="P19" caption="Output Driving Capability Register Bit 1" mask="0x80000"/>
          <bitfield name="P20" caption="Output Driving Capability Register Bit 1" mask="0x100000"/>
          <bitfield name="P21" caption="Output Driving Capability Register Bit 1" mask="0x200000"/>
          <bitfield name="P22" caption="Output Driving Capability Register Bit 1" mask="0x400000"/>
          <bitfield name="P23" caption="Output Driving Capability Register Bit 1" mask="0x800000"/>
          <bitfield name="P24" caption="Output Driving Capability Register Bit 1" mask="0x1000000"/>
          <bitfield name="P25" caption="Output Driving Capability Register Bit 1" mask="0x2000000"/>
          <bitfield name="P26" caption="Output Driving Capability Register Bit 1" mask="0x4000000"/>
          <bitfield name="P27" caption="Output Driving Capability Register Bit 1" mask="0x8000000"/>
          <bitfield name="P28" caption="Output Driving Capability Register Bit 1" mask="0x10000000"/>
          <bitfield name="P29" caption="Output Driving Capability Register Bit 1" mask="0x20000000"/>
          <bitfield name="P30" caption="Output Driving Capability Register Bit 1" mask="0x40000000"/>
          <bitfield name="P31" caption="Output Driving Capability Register Bit 1" mask="0x80000000"/>
        </register>
        <register name="OSRR0" offset="0x130" rw="RW" size="4" access-size="4" caption="Output Slew Rate Register 0">
          <bitfield name="P0" caption="Output Slew Rate Control Enable" mask="0x1"/>
          <bitfield name="P1" caption="Output Slew Rate Control Enable" mask="0x2"/>
          <bitfield name="P2" caption="Output Slew Rate Control Enable" mask="0x4"/>
          <bitfield name="P3" caption="Output Slew Rate Control Enable" mask="0x8"/>
          <bitfield name="P4" caption="Output Slew Rate Control Enable" mask="0x10"/>
          <bitfield name="P5" caption="Output Slew Rate Control Enable" mask="0x20"/>
          <bitfield name="P6" caption="Output Slew Rate Control Enable" mask="0x40"/>
          <bitfield name="P7" caption="Output Slew Rate Control Enable" mask="0x80"/>
          <bitfield name="P8" caption="Output Slew Rate Control Enable" mask="0x100"/>
          <bitfield name="P9" caption="Output Slew Rate Control Enable" mask="0x200"/>
          <bitfield name="P10" caption="Output Slew Rate Control Enable" mask="0x400"/>
          <bitfield name="P11" caption="Output Slew Rate Control Enable" mask="0x800"/>
          <bitfield name="P12" caption="Output Slew Rate Control Enable" mask="0x1000"/>
          <bitfield name="P13" caption="Output Slew Rate Control Enable" mask="0x2000"/>
          <bitfield name="P14" caption="Output Slew Rate Control Enable" mask="0x4000"/>
          <bitfield name="P15" caption="Output Slew Rate Control Enable" mask="0x8000"/>
          <bitfield name="P16" caption="Output Slew Rate Control Enable" mask="0x10000"/>
          <bitfield name="P17" caption="Output Slew Rate Control Enable" mask="0x20000"/>
          <bitfield name="P18" caption="Output Slew Rate Control Enable" mask="0x40000"/>
          <bitfield name="P19" caption="Output Slew Rate Control Enable" mask="0x80000"/>
          <bitfield name="P20" caption="Output Slew Rate Control Enable" mask="0x100000"/>
          <bitfield name="P21" caption="Output Slew Rate Control Enable" mask="0x200000"/>
          <bitfield name="P22" caption="Output Slew Rate Control Enable" mask="0x400000"/>
          <bitfield name="P23" caption="Output Slew Rate Control Enable" mask="0x800000"/>
          <bitfield name="P24" caption="Output Slew Rate Control Enable" mask="0x1000000"/>
          <bitfield name="P25" caption="Output Slew Rate Control Enable" mask="0x2000000"/>
          <bitfield name="P26" caption="Output Slew Rate Control Enable" mask="0x4000000"/>
          <bitfield name="P27" caption="Output Slew Rate Control Enable" mask="0x8000000"/>
          <bitfield name="P28" caption="Output Slew Rate Control Enable" mask="0x10000000"/>
          <bitfield name="P29" caption="Output Slew Rate Control Enable" mask="0x20000000"/>
          <bitfield name="P30" caption="Output Slew Rate Control Enable" mask="0x40000000"/>
          <bitfield name="P31" caption="Output Slew Rate Control Enable" mask="0x80000000"/>
        </register>
        <register name="OSRR0S" offset="0x134" rw="RW" size="4" access-size="4" atomic-op="set:OSRR0" caption="Output Slew Rate Register 0 - Set">
          <bitfield name="P0" caption="Output Slew Rate Control Enable" mask="0x1"/>
          <bitfield name="P1" caption="Output Slew Rate Control Enable" mask="0x2"/>
          <bitfield name="P2" caption="Output Slew Rate Control Enable" mask="0x4"/>
          <bitfield name="P3" caption="Output Slew Rate Control Enable" mask="0x8"/>
          <bitfield name="P4" caption="Output Slew Rate Control Enable" mask="0x10"/>
          <bitfield name="P5" caption="Output Slew Rate Control Enable" mask="0x20"/>
          <bitfield name="P6" caption="Output Slew Rate Control Enable" mask="0x40"/>
          <bitfield name="P7" caption="Output Slew Rate Control Enable" mask="0x80"/>
          <bitfield name="P8" caption="Output Slew Rate Control Enable" mask="0x100"/>
          <bitfield name="P9" caption="Output Slew Rate Control Enable" mask="0x200"/>
          <bitfield name="P10" caption="Output Slew Rate Control Enable" mask="0x400"/>
          <bitfield name="P11" caption="Output Slew Rate Control Enable" mask="0x800"/>
          <bitfield name="P12" caption="Output Slew Rate Control Enable" mask="0x1000"/>
          <bitfield name="P13" caption="Output Slew Rate Control Enable" mask="0x2000"/>
          <bitfield name="P14" caption="Output Slew Rate Control Enable" mask="0x4000"/>
          <bitfield name="P15" caption="Output Slew Rate Control Enable" mask="0x8000"/>
          <bitfield name="P16" caption="Output Slew Rate Control Enable" mask="0x10000"/>
          <bitfield name="P17" caption="Output Slew Rate Control Enable" mask="0x20000"/>
          <bitfield name="P18" caption="Output Slew Rate Control Enable" mask="0x40000"/>
          <bitfield name="P19" caption="Output Slew Rate Control Enable" mask="0x80000"/>
          <bitfield name="P20" caption="Output Slew Rate Control Enable" mask="0x100000"/>
          <bitfield name="P21" caption="Output Slew Rate Control Enable" mask="0x200000"/>
          <bitfield name="P22" caption="Output Slew Rate Control Enable" mask="0x400000"/>
          <bitfield name="P23" caption="Output Slew Rate Control Enable" mask="0x800000"/>
          <bitfield name="P24" caption="Output Slew Rate Control Enable" mask="0x1000000"/>
          <bitfield name="P25" caption="Output Slew Rate Control Enable" mask="0x2000000"/>
          <bitfield name="P26" caption="Output Slew Rate Control Enable" mask="0x4000000"/>
          <bitfield name="P27" caption="Output Slew Rate Control Enable" mask="0x8000000"/>
          <bitfield name="P28" caption="Output Slew Rate Control Enable" mask="0x10000000"/>
          <bitfield name="P29" caption="Output Slew Rate Control Enable" mask="0x20000000"/>
          <bitfield name="P30" caption="Output Slew Rate Control Enable" mask="0x40000000"/>
          <bitfield name="P31" caption="Output Slew Rate Control Enable" mask="0x80000000"/>
        </register>
